Revit 2026 API

# MEPAnalyticalConnectionCreateMultipleConnections Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ISet<ElementId> CreateMultipleConnections(
	Document doc,
	ElementId typeId,
	IList<Connector> equipmentOpenConnectors,
	IList<ElementId> curveIdsToConnect
)
```
```vb
Public Shared Function CreateMultipleConnections (
	doc As Document,
	typeId As ElementId,
	equipmentOpenConnectors As IList(Of Connector),
	curveIdsToConnect As IList(Of ElementId)
) As ISet(Of ElementId)
```
```cpp
public:
static ISet<ElementId^>^ CreateMultipleConnections(
	Document^ doc,
	ElementId^ typeId,
	IList<Connector^>^ equipmentOpenConnectors,
	IList<ElementId^>^ curveIdsToConnect
)
```
```fsharp
static member CreateMultipleConnections :
        doc : Document *
        typeId : ElementId *
        equipmentOpenConnectors : IList<Connector> *
        curveIdsToConnect : IList<ElementId> -> ISet<ElementId>
```

#### Parameters

doc Document

typeId ElementId

equipmentOpenConnectors IListConnector

curveIdsToConnect IListElementId

#### Return Value

ISetElementId

#### Reference

MEPAnalyticalConnection Class

Autodesk.Revit.DB Namespace